app/controllers/songs_controller.rb

INSERT INTO "artists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", ".38 Special"], ["created_at", "2018-09-28 23:12:26.628442"], ["updated_at", "2018-09-28 23:12:26.628442"]]
SELECT  "artists".* FROM "artists" WHERE "artists"."name" = ? LIMIT 1  [["name", ".38 Special"]]
---
  def upload
    CSV.foreach(params[:songs].path, headers: true) do |song|
      newArtsit = Artist.find_or_create_by(name: song[1])